post_list = ["Заведующий", "Заместитель Заведующего (ЗУМ)","Продавец-кассир", "Руководитель групп магазинов"
            ,"Специалист группы запуска", "Заместитель руководителя группы запуска", "Руководитель группы запуска"]
hours_day_plan_dict = {
                    12:["Санкт-Петербург", "Ленинградская область","Тверская область","Республика Карелия"]
                    ,13:["Великий Новгород", "Новгородская область"]
                    ,14:["Москва","Московская область"]
                    }
hours_month_plan_dict = {
                    183:["Санкт-Петербург", "Ленинградская область","Тверская область","Республика Карелия"]
                    , 198:["Великий Новгород", "Новгородская область"]
                    , 214:["Москва","Московская область"]
                    }
